#include <iostream>
#include <vector>
#define cinf(n,x) for(int i = 0;i<n;i++)cin >>x[i];
using namespace std;
int main() {
	//桁数nを入力
	int n;
	cin >> n;

	//n桁の被加数a[n]を入力。但し-1から1まで
	vector<int> a(n);
	cinf(n, a);

	//n桁の加数b[n]を入力。但し-1から1まで
	vector<int> b(n);
	cinf(n, b);

	///n桁の中間桁上げc[n]と中間和s[n]と和sum[n]の配列を生成
	vector <int>c(n);
	vector <int>s(n);

	/*一番下の桁の被加数と加数から中間和と中間桁上げの場合分けを以下のように行った。
	二番目以降の桁は一つ下の桁の被加数と加数の値によって分岐するが、この桁だけは分岐しないため、他の桁とは別で処理を行った。*/
	if (a[0] == 1 && b[0] == 1) {
		c[0] = 1;
		s[0] = 0;
	}
	else if ((a[0] == 1 && b[0] == 0) || (a[0] == 0 && b[0] == 1)) {
		c[0] = 0;
		s[0] = 1;
	}
	else if (a[0] == 0 && b[0] == 0) {
		c[0] = 0;
		s[0] = 0;
	}
	else if ((a[0] == -1 && b[0] == 1) || (a[0] == 1 && b[0] == -1)) {
		c[0] = 0;
		s[0] = 0;
	}
	else if ((a[0] == -1 && b[0] == 0) || (a[0] == 0 && b[0] == -1)) {
		c[0] = 0;
		s[0] = -1;
	}
	else if (a[0] == -1 && b[0] == -1) {
		c[0] = -1;
		s[0] = 0;
	}
	
	/*2桁目以降の桁の被加数と加数から中間和と中間桁上げの場合分けを以下のように行った。
	一桁目とは異なり、前の桁の被加数と加数の値によって分岐することがある。*/
	for (int i = 1; i < n; i++) {
		if (a[i] == 1 && b[i] == 1) {
			c[i] = 1;
			s[i] = 0;
		}
		else if ((a[i] == 1 && b[i] == 0) || (a[i] == 0 && b[i] == 1)) {
			if (a[i - 1] >= 0 && b[i - 1] >= 0) {
				c[i] = 1;
				s[i] = -1;
			}
			else {
				c[i] = 0;
				s[i] = 1;
			}
		}
		else if (a[i] == 0 && b[i] == 0) {
			c[i] = 0;
			s[i] = 0;
		}
		else if ((a[i] == 1 && b[i] == -1) || (a[i] == -1 && b[i] == 1)) {
			c[i] = 0;
			s[i] = 0;
		}
		else if ((a[i] == 0 && b[i] == -1) || (a[i] == -1 && b[i] == 0)) {
			if (a[i - 1] >= 0 && b[i - 1] >= 0) {
				c[i] = 0;
				s[i] = -1;
			}
			else {
				c[i] = -1;
				s[i] = 1;
			}
		}
		else if (a[i] == -1 && b[i] == -1) {
			c[i] = -1;
			s[i] = 0;
		}
	}
	
	//全ての桁の中間桁上げを出力
	for (int i = 0; i < n; i++) {
		cout << c[i] << " ";
	}
	cout << endl;

	//全ての桁の中間和を出力
	for (int i = 0; i < n; i++) {
		cout << s[i] << " ";
	}
	cout << endl;
}